tutorials/modules/incompressibleFluid/movingCone/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

mapTimes="0.0015 0.003"

# Iterate the string variable using for loop
for mapTime in $mapTimes; do

    runApplication -a blockMesh -dict blockMeshDict_$mapTime
    rm -rf constant/meshToMesh_$mapTime
    mkdir constant/meshToMesh_$mapTime
    mv constant/polyMesh constant/meshToMesh_$mapTime

done

runApplication -a blockMesh

runApplication $application

#------------------------------------------------------------------------------
